[
    {
        "title": "Palette App",
        "url": "https://palettte.app/",
        "date": "Feb 10, 2019",
        "description": "Color palette generator that actually feels well thought-out. This tool enables you to create consistent and logical color palettes that work. Also super fun to visualize the [HSL](https://en.wikipedia.org/wiki/HSL_and_HSV) relationship between the colors in a palette."
    },
    {
        "title": "The Desktop Metaphor Must Die",
        "url": "https://medium.com/@jasonyuan/the-desktop-metaphor-must-die-676fbb34afdb",
        "date": "May 23, 2019",
        "description": "Thought-provoking article on how the desktop metafore is reaching its due date. Focuses on how human-focused a desktop really is, since it allows us to get overwhelmed by multitasking, and how it should stimulate us to get in [a state of flow](https://en.wikipedia.org/wiki/Flow_(psychology))."
    },
    {
        "title": "Agile: why your efforts will fail and what to do about it",
        "url": "https://www.forbes.com/sites/tracybrower/2019/05/27/agile-why-your-efforts-will-fail-and-what-to-do-about-it/",
        "date": "May 28, 2019",
        "description": "An article on common pitfalls Agile development teams might come across. There are no real solutions offered in this piece, but naming issues is the first step towards solving them."
    },
    {
        "title": "What it takes to be a product designer",
        "url": "https://uxdesign.cc/what-it-takes-to-be-a-product-designer-424a4151261e",
        "date": "Jun 04, 2019",
        "description": "This article tries to define what a product designer actually does, without talking other roles down. From the excellent [twitter thread](https://twitter.com/round/status/1062407835760226306?s=19) by [Maxim](https://twitter.com/round)."
    },
    {
        "title": "Not everything needs to be a user story",
        "url": "https://www.mountaingoatsoftware.com/blog/not-everything-needs-to-be-a-user-story-using-fdd-features",
        "date": "Jun 06, 2019",
        "description": "This article proposes that when user stories don't fit the task on your backlog, [Feature Driven Development](https://en.wikipedia.org/wiki/Feature-driven_development) might. This is a great alternative for classic [User Stories](https://en.wikipedia.org/wiki/User_story) or something like [Hypothesis-Driven Development](https://www.thoughtworks.com/insights/blog/how-implement-hypothesis-driven-development)."
    },
    {
        "title": "Road to Estimates",
        "url": "https://locastic.com/blog/road-to-estimates/",
        "date": "Jul 03, 2019",
        "description": "Great in-depth description on how Locastic comes up with estimates for tailor-made software projects."
    },
    {
        "title": "The 7 most important UX KPIs and how to measure them",
        "url": "https://www.testingtime.com/en/blog/important-ux-kpis/",
        "date": "Jul 04, 2019",
        "description": "Article on what KPIs actually make sense to measure and monitor in the frontend of a product. A must-read when implementing telemetrics in your appliation."
    },
    {
        "title": "Leveraging the Kano Model for Optimal Results",
        "url": "http://uxmag.com/articles/leveraging-the-kano-model-for-optimal-results",
        "date": "Jul 06, 2019",
        "description": "The Kano model provides a framework for measuring delight. Researching proposed features for a product via the Kano model helps decision makers to better understand their priorities from a user perspective."
    },
    {
        "title": "How to build a product roadmap everyone understands",
        "url": "https://www.prodpad.com/blog/how-to-build-a-product-roadmap-everyone-understands/",
        "date": "Jul 06, 2019",
        "description": "Most roadmaps focus on features, and are too detailed or complicated. A roadmap should be focused on the high level strategic direction of a product, categorized in themes. It should communicate business goals and objectives, product areas, the order of priorities and a sense of scope."
    },
    {
        "title": "Handling unplanned work",
        "url": "https://www.leadingagile.com/2018/08/handling-unplanned-work/",
        "date": "Jul 08, 2019",
        "description": "Unplanned work is usually treated as a disturbance of the planned work. This article states that instead, it should be treated as a natural result of an agile way of working, because new insights may occur. Also, it states that programmers don't just write bad code, so the root of the bug might be a communication issue."
    },
    {
        "title": "Is High Quality Software worth the cost?",
        "url": "https://martinfowler.com/articles/is-quality-worth-cost.html",
        "date": "Jul 11, 2019",
        "description": "Delivering features faster is better, right? Well, in the short term you might be right. But in the long term not so much. This article explains why investing in quality software will result in software that is more agile and robust."
    }
]